{

    "experiences": [
        {
            "company": "Ninety.io",
            "slug": "ninety",
            "companyImgUrl": "logos/90.svg",
            "title": "Senior Software Engineer",
            "date": "2023 - Present",
            "description": "Hired specifically to help lead and build a design system for Ninety.",
            "descriptionBullets": [
                "Worked with design system design lead to define and build a design system.",
                "Scoped, prioritized, and built components for the design system.",
                "Migrated existing components to the new design system with minimal impact to the business.",
                "Develop various tools to help make Figma the source of truth for design system artifacts.",
                "Define a documentation strategy for the design system components."
            ],
            "screenshots": []
        },
        {
            "company": "Cricut",
            "slug": "cricut",
            "companyImgUrl": "logos/cricut.png",
            "title": "Senior Software Engineer, Staff Software Engineer",
            "date": "2016 - 2023",
            "description": [
                "During my time at Cricut I was able to work on many projects.  Some of the key projects include the following:"
            ],
            "descriptionBullets": [
                "Introduced, built, and defined internal design system and component library. Worked closely with UI counterparts to audit, propose, and build new components defined by UI in Angular.",
                "Introduced Storybook to document components for designers and developers. Researched and built components with full accessibility in mind, including keyboard navigation, contrast ratios, and screen reader information.",
                "Created and tested components to work in right-to-left languages.",
                "Utilized Chromatic to add visual regression testing for the component library. ",
                "Built various scripts to treat Figma as the source of truth for design system artifacts (colors, icons, typography). Allowing desktop, iOS, and Android platforms to use abstracted design tokens on their platforms.",
                "Built automation tooling around internationalization (i18n) workflow. Allowing individual teams/pods to be more autonomous.",
                "Architected distributed frameworks for pods to be able to work independently of the main bundling application and other pods.",
                "Assisted in defining and overseeing migration from a single monorepo to distributed pod repo structure.",
                "Introduced, built, defined, and managed the internationalization (i18n) process and migration for the entire desktop application",
                "Introduced, defined, and built an interactive tutorial system. Allowing developers to define a custom tutorial and have the framework dynamically highlight elements for users to interact with and to progress the tutorial",
                "Created curved text feature. Required working with custom drawing framework to overcome rendering issues to ensure a 60 fps experience for users.",
                "Managed, taught, and coached interns with writing unit-test coverage for the application.",
                "Introduced and built the initial unit tests for the application and created consistent patterns for other developers to follow."
            ],
            "screenshots": []
        },
        {
            "company": "Western Governors University",
            "slug": "western-governors-university",
            "companyImgUrl": "logos/wgu.svg",
            "title": "Tech Lead, Senior UI/UX Developer",
            "date":"2013 - 2026",
            "description": "Hired at WGU as the first UI developer on a new UI/UX team. WGU had a student portal that was built on older technologies and wasn't able to scale. I was tasked with moving the front-end to a more scalable solution for future student growth.",
            "descriptionBullets": [
                "Introduced new technologies such as AngularJS, Sass, GruntJS.",
                "Created centralized and re-usable GruntJS based development stack with necessary tools needed for a wide variety of tasks.",
                "Built Sass centric CSS framework of reusable components to achieve a consistent brand for the students.",
                "Rebuilt student portal with AngularJS and orchestrated multiple applications and parallel releases for minimal impact on the business.",
                "Architected deployment processes, and server architecture for front-end related files.",
                "Orchestrated front-end move to service oriented architecture with minimal impact to the students.",
                "Interviewed candidates for open UI developer positions.",
                "Implemented code reviews and standards among the team.",
                "Introduced and trained on unit tests in JavaScript",
                "Trained other developers in related technologies as needed."
            ],
            "screenshots": [
                "wgu1.png",
                "wgu2.png",
                "wgu3.png",
                "wgu4.png",

                "wgu5.png",
                "wgu6.png",
                "wgu7.png",
                "wgu8.png",
                "wgu9.png",
                "wgu10.png",
                "wgu11.png",
                "wgu12.png"
            ]

        },
        {
            "company": "Clearlink",
            "slug": "clearlink",
            "companyImgUrl": "logos/clearlink.png",
            "title": "Frontend Developer",
            "date":"2012 - 2013",
            "description": "As a front-end developer at Clearlink I worked on several sites and brands. This allowed me to quickly iterate on new skills and techniques in the industry.",
            "descriptionBullets": [
                "Introduced responsive design and development.",
                "Introduced Sass as a CSS tool to help with large CSS projects.",
                "Created an elegant product search and checkout process for AT&T services."
            ]
        },
        {
            "company": "BYU: Chemistry Department",
            "slug": "byu-chemistry-department",
            "companyImgUrl": "logos/byu.svg",
            "title": "Web Applications Developer",
            "date":"2012 - 2013",
            "description": "During my time as a web applications developer for the BYU Chemistry Department I was able to work on several exciting projects. I was initially hired as a PHP developer to help maintain several PHP based applications. I was cross trained in Django and spent most of my time with that technology stack. During my time I was able to work closely with several faculty members to gather requirements, develop, test, and gather feedback.",
            "descriptionBullets": [
                "Supported custom Drupal modules for department needs.",
                "Learned Django and wrote several applications with it for faculty members.",
                "Worked closely with faculty to gather requirements, test, and improve applications.",
                "Helped interview candidates"
            ]
        }
    ],
    "projects" : [
        {
            "name": "Coaster Creds",
            "status": "Available",
            "url": "https://coastercreds.com",
            "imgUrl": "/logos/cc.png",
            "description": "App that allows for users to track which roller coasters they've ridden around the world.",
            "skills": [
                "angular",
                "material",
                "django",
                "mysql"
            ]
        },
        {
            "name": "Rendered Mouse",
            "status": "Available",
            "url": "https://renderedmouse.com",
            "imgUrl": "/logos/rm.png",
            "description": "Personal hobby projects site.  Recently overhauled and upgraded it to require 75% less code.",
            "skills": [
                "django",
                "mySQL"
            ]
        },
        {
            "name": "Packing App",
            "status": "Limited",
            "imgUrl": "/logos/pack.png",
            "description": "Small app for helping with packing for trips.  App is focused on simplicity of the required task.",
            "skills": [
                "angular",
                "firebase",
                "material"
            ]
        },
        {
            "name": "Meal Tracking App",
            "status": "Limited",
            "imgUrl": "/logos/food.png",
            "description": "Simple app for tracking meal preferences for family members.",
            "skills": [
                "angular",
                "firebase",
                "material"
            ]
        },
        {
            "name": "Yesterday's Big Thing",
            "status": "Discontinued",
            "url": "http://web.archive.org/web/20140130111809/http://www.yesterdaysbigthing.com/2014/01/30/",
            "imgUrl": "/logos/ybt.png",
            "description": "YouTube aggregator site to showcase the best videos of YouTube.",
            "skills": [
                "Django"
            ]
        },
        {
            "name": "Coaster Wall",
            "status": "Discontinued",
            "imgUrl": "/logos/cw.png",
            "description": "CoasterWall was a place to share theme park related desktop pictures. It allowed users to upload images, crop them, and tag them for others to see.",
            "skills": [
                "django"
            ]
        },
        {
            "name": "Digital Nurse Practitioner Software",
            "status": "Capstone Project",
            "imgUrl": "/logos/byu.svg",
            "description": "Capstone project that required working with the graduate nursing program of BYU. Worked as a client to the department to solve the issue with massive amounts of paper documentation. ",
            "skills": [
                "django"

            ]
        }
    ],
    "skills": [
        "angular",
        "html",
        "css",
        "scss",
        "figma",
        "javascript",
        "typescript",
        "django"
    ]
}